In [ ]:
import pandas as pd
new_list=pd.Series([2,4,6,8,10,12],index=['a','b','c','d','e','f'])
print(new_list)

a     2
b     4
c     6
d     8
e    10
f    12
dtype: int64

In [23]:
import pandas as pd
import numpy as np
num=np.random.randint(4,6,(3,4))
new_num=pd.DataFrame(num,columns=['Abi','Sai','Aji','Manu'],index=[1,2,3])
print(new_num)

   Abi  Sai  Aji  Manu
1    4    4    5     4
2    4    4    4     4
3    4    5    5     5

In [24]:
li=[['Ani',20],['Sai',25],['Mini',30]]
new_li=pd.DataFrame(li)
print(new_li)

      0   1
0   Ani  20
1   Sai  25
2  Mini  30

In [30]:

details={'Employee':['Nibi','Danvi','Sabu'],'Income':[2000,3000,4000]}
new_details=pd.DataFrame(details)
print(new_details)

  Employee  Income
0     Nibi    2000
1    Danvi    3000
2     Sabu    4000

In [31]:
d1={'Person1':{'Name':'Anu','Age':20,'City':'Chennai'},'Person2':{'Name':'kathu','Age':10,'City':'Trivandrum'}}
d2=pd.DataFrame(d1)
print(d2)

      Person1     Person2
Name      Anu       kathu
Age        20          10
City  Chennai  Trivandrum

In [38]:
x=[{'a':20,'b':30,'c':40},{'a':10,'c':50}]
y=pd.DataFrame(x)
print(y)

    a     b   c
0  20  30.0  40
1  10   NaN  50

In [44]:
a=['anu','jaison','christy','sanju']
b=[20,30,40,np.nan]
new_ab=list(zip(a,b))
li=pd.DataFrame(new_ab)
print(li)

         0     1
0      anu  20.0
1   jaison  30.0
2  christy  40.0
3    sanju   NaN

In [2]:
import pandas as pd
import numpy as np
arr=np.random.randn(105,4)
new_arr=pd.DataFrame(arr,columns=['A','B','C','D'])
print(new_arr)

            A         B         C         D
0    0.066496  0.809907 -0.533392  1.526570
1   -1.566509  0.324405  0.365259 -0.978233
2   -0.407154  0.670332  2.093195  0.668658
3    0.000966 -0.225147 -1.123857  0.325925
4    0.653857  0.031889 -0.159998  0.049508
..        ...       ...       ...       ...
100 -0.249439 -0.027471 -1.755987  0.014816
101 -0.300300 -0.086839  0.213142  0.955177
102  0.674189  2.147843  0.457944  0.756636
103  1.538353  0.038420  1.365887 -0.288221
104  0.895898 -0.961774  1.541189  0.559287

[105 rows x 4 columns]

In [4]:
new_arr.head(8)

          A         B         C         D
0  0.066496  0.809907 -0.533392  1.526570
1 -1.566509  0.324405  0.365259 -0.978233
2 -0.407154  0.670332  2.093195  0.668658
3  0.000966 -0.225147 -1.123857  0.325925
4  0.653857  0.031889 -0.159998  0.049508
5 -0.172376  1.467953 -1.629277  1.874892
6 -0.431776  2.739986  0.259512  0.228901
7 -0.384752 -0.237778 -0.388902  0.588348

In [5]:
new_arr.tail()

            A         B         C         D
100 -0.249439 -0.027471 -1.755987  0.014816
101 -0.300300 -0.086839  0.213142  0.955177
102  0.674189  2.147843  0.457944  0.756636
103  1.538353  0.038420  1.365887 -0.288221
104  0.895898 -0.961774  1.541189  0.559287

In [16]:
new_arr.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [17]:
new_arr.shape

(105, 4)

In [18]:
new_arr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 105 entries, 0 to 104
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       105 non-null    float64
 1   B       105 non-null    float64
 2   C       105 non-null    float64
 3   D       105 non-null    float64
dtypes: float64(4)
memory usage: 3.4 KB

In [19]:
new_arr.describe()

                A           B           C           D
count  105.000000  105.000000  105.000000  105.000000
mean     0.019657    0.112694    0.062155    0.223171
std      0.985834    1.027369    0.985927    0.997552
min     -1.780751   -2.990281   -3.064361   -2.631834
25%     -0.649028   -0.410692   -0.467554   -0.288221
50%     -0.100077    0.173269    0.146268    0.223161
75%      0.674189    0.811609    0.597676    0.897956
max      2.687909    2.739986    2.510747    2.704613

In [5]:
import pandas as pd
sales_df=pd.read_csv("C:\\Users\\ABINANDH SREEKUMAR\\Downloads\\company_sales_data.csv")
print(sales_df)

    month_number  facecream  facewash  toothpaste  bathingsoap  shampoo  \
0              1       2500      1500        5200         9200     1200
1              2       2630      1200        5100         6100     2100
2              3       2140      1340        4550         9550     3550
3              4       3400      1130        5870         8870     1870
4              5       3600      1740        4560         7760     1560
5              6       2760      1555        4890         7490     1890
6              7       2980      1120        4780         8980     1780
7              8       3700      1400        5860         9960     2860
8              9       3540      1780        6100         8100     2100
9             10       1990      1890        8300        10300     2300
10            11       2340      2100        7300        13300     2400
11            12       2900      1760        7400        14400     1800

    moisturizer  total_units  total_profit
0          1500        21100        211000
1          1200        18330        183300
2          1340        22470        224700
3          1130        22270        222700
4          1740        20960        209600
5          1555        20140        201400
6          1120        29550        295500
7          1400        36140        361400
8          1780        23400        234000
9          1890        26670        266700
10         2100        41280        412800
11         1760        30020        300200

In [6]:
sales_df.shape

(12, 9)

In [7]:
sales_df.head()

,month_number,facecream,facewash,toothpaste,bathingsoap,shampoo,moisturizer,total_units,total_profit
0,1,2500,1500,5200,9200,1200,1500,21100,211000
1,2,2630,1200,5100,6100,2100,1200,18330,183300
2,3,2140,1340,4550,9550,3550,1340,22470,224700
3,4,3400,1130,5870,8870,1870,1130,22270,222700
4,5,3600,1740,4560,7760,1560,1740,20960,209600

In [8]:
sales_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   month_number  12 non-null     int64
 1   facecream     12 non-null     int64
 2   facewash      12 non-null     int64
 3   toothpaste    12 non-null     int64
 4   bathingsoap   12 non-null     int64
 5   shampoo       12 non-null     int64
 6   moisturizer   12 non-null     int64
 7   total_units   12 non-null     int64
 8   total_profit  12 non-null     int64
dtypes: int64(9)
memory usage: 996.0 bytes

In [9]:
sales_df.describe()

,month_number,facecream,facewash,toothpaste,bathingsoap,shampoo,moisturizer,total_units,total_profit
count,12.000000,12.000000,12.000000,12.000000,12.000000,12.000000,12.000000,12.00000,12.000000
mean,6.500000,2873.333333,1542.916667,5825.833333,9500.833333,2117.500000,1542.916667,26027.50000,260275.000000
std,3.605551,584.595172,316.733745,1242.032486,2348.095779,617.724931,316.733745,7014.36594,70143.659404
min,1.000000,1990.000000,1120.000000,4550.000000,6100.000000,1200.000000,1120.000000,18330.00000,183300.000000
25%,3.750000,2460.000000,1305.000000,4862.500000,8015.000000,1795.000000,1305.000000,21065.00000,210650.000000
50%,6.500000,2830.000000,1527.500000,5530.000000,9090.000000,1995.000000,1527.500000,22935.00000,229350.000000
75%,9.250000,3435.000000,1765.000000,6400.000000,10045.000000,2325.000000,1765.000000,29667.50000,296675.000000
max,12.000000,3700.000000,2100.000000,8300.000000,14400.000000,3550.000000,2100.000000,41280.00000,412800.000000

In [10]:
sales_df.columns

Index(['month_number', 'facecream', 'facewash', 'toothpaste', 'bathingsoap',
       'shampoo', 'moisturizer', 'total_units', 'total_profit'],
      dtype='object')

In [ ]:
sales_df['facecream']

0     2500
1     2630
2     2140
3     3400
4     3600
5     2760
6     2980
7     3700
8     3540
9     1990
10    2340
11    2900
Name: facecream, dtype: int64

In [12]:
titanic_df=pd.read_csv("C:\\Users\\ABINANDH SREEKUMAR\\Downloads\\titanic.csv")
print(titanic_df)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

In [13]:
titanic_df.shape

(891, 12)

In [14]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [15]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [17]:
titanic_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [ ]:
# Access the Element
titanic_df[['Name','Sex']]

                                                  Name     Sex
0                              Braund, Mr. Owen Harris    male
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2                               Heikkinen, Miss. Laina  female
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4                             Allen, Mr. William Henry    male
..                                                 ...     ...
886                              Montvila, Rev. Juozas    male
887                       Graham, Miss. Margaret Edith  female
888           Johnston, Miss. Catherine Helen "Carrie"  female
889                              Behr, Mr. Karl Howell    male
890                                Dooley, Mr. Patrick    male

[891 rows x 2 columns]

In [25]:
# Slicing
titanic_df[2:7]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S

In [2]:
import pandas as pd
l=[10,20,30,40]
s=pd.Series(l)
print(s)

0    10
1    20
2    30
3    40
dtype: int64